# 확인문제2

# 10진수와 2진수 변환

print("{:b}".format(10))    # 10을 2진수로 -> 1010

print(int("1010", 2))   # 1010을 10진수로 -> 10

print(("안녕안녕하세요").count("안"))   #문자 "안"의 개수 -> 2
# 위에는 설명.

# 1~100 사이에 있는 숫자 중 2진수로 변환했을 때 0이 하나만 포함된 숫자를 찾고,
# 그 숫자들의 합을 구하는 코드

# 방법 1
print("*** 방법1 ***")
output_1 = 0

for j in range(1, 100 +1):
    if "{:b}".format(j).count("0") == 1:
        print("{} : {:b}".format(j, j))
        output_1 += j
print("합계: {}".format(output_1))
print("----------------------------")

# 방법2
print("*** 방법2 ***")
output_2 = [i for i in range(1, 100, +1) if "{:b}".format(i).count("0") == 1]
for i in output_2:
    print("{} : {}".format(i, "{:b}".format(i)))
print("합계: {}".format(sum(output_2)))

'''
# 출력값
1010
10
2
*** 방법1 ***
2 : 10
5 : 101
6 : 110
11 : 1011
13 : 1101
14 : 1110
23 : 10111
27 : 11011
29 : 11101
30 : 11110
47 : 101111
55 : 110111
59 : 111011
61 : 111101
62 : 111110
95 : 1011111
합계: 539
----------------------------
*** 방법2 ***
2 : 10
5 : 101
6 : 110
11 : 1011
13 : 1101
14 : 1110
23 : 10111
27 : 11011
29 : 11101
30 : 11110
47 : 101111
55 : 110111
59 : 111011
61 : 111101
62 : 111110
95 : 1011111
합계: 539
'''